modules/ome-common-lisp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Common Lisp</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Common Lisp"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Common Lisp</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This file contains some settings for <a href="#sec-3">Common Lisp</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#common-lisp-prerequisites">Prerequisites</a></li>
<li><a href="#common-lisp-el-get-packages">El-get packages</a></li>
<li><a href="#common-lisp">Common Lisp</a></li>
<li><a href="#sec-4">Todos</a></li>
</ul>
</div>
</div>

<div id="outline-container-common-lisp-prerequisites" class="outline-2">
<h2 id="common-lisp-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-common-lisp-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-common-lisp module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://www.sbcl.org/">SBCL</a></td><td class="left"></td><td class="left">sbcl</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">Yes</td></tr>
<tr><td class="left"><a href="http://ccl.clozure.com/">Clozure CL</a></td><td class="left"></td><td class="left">[web]</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">No</td></tr>
<tr><td class="left"><a href="http://www.clisp.org/">CLISP</a></td><td class="left"></td><td class="left">clisp</td><td class="left"></td><td class="left"></td><td class="left"></td><td class="left">No</td></tr>
</tbody>
</table>


<p>
Note:
</p><ul>
<li><a href="http://www.sbcl.org/">SBCL</a> or <a href="http://ccl.clozure.com/">Clozure CL</a> or <a href="http://www.clisp.org/">CLISP</a> as a Common Lisp implementation. I recommend
  SBCL since it has good performance, and is easy to install via package
  manager.
</li>
</ul>


</div>

</div>

<div id="outline-container-common-lisp-el-get-packages" class="outline-2">
<h2 id="common-lisp-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-common-lisp-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-common-lisp module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://common-lisp.net/project/slime/">slime</a></td><td class="left">Required</td><td class="left">One of the most amazing packages for Emacs.</td></tr>
<tr><td class="left"><a href="https://github.com/purcell/ac-slime">ac-slime</a></td><td class="left">Required</td><td class="left">AC backend for slime.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-common-lisp" class="outline-2">
<h2 id="common-lisp"><a name="sec-3" id="sec-3"></a>Common Lisp</h2>
<div class="outline-text-2" id="text-common-lisp">


<p>
<a href="http://common-lisp.net/project/slime/">SLIME</a> is the Superior Lisp Interaction Mode for Emacs, here're some <a href="http://www.cliki.net/SLIME%20Features">features</a>
and <a href="http://www.cliki.net/SLIME%20Tips">tips</a>. Believe me, SLIME in Emacs is a subversive developing environment for
Common Lisp, it is the ultimate solution for languages with a <a href="http://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop">REPL</a>. SLIME is
the bridge between an Editor(here, Emacs for example, vim users have a <a href="http://www.vim.org/scripts/script.php?script_id=2531">slimv</a>
which is a fork of SLIME to vim) and a running Common Lisp environment. It
makes your workflow so smooth and enjoyable that you will miss it so much when
working with other REPL languages such as Python/Ruby/JavaScript<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>, etc.
</p>
<p>
Some good resources about SLIME:
</p><ul>
<li><a href="http://bc.tech.coop/blog/081209.html">Understanding SLIME (Using Emacs and Lisp Cooperatively)</a>, a really concise
  explanation of SLIME's architecture, together with lots of valuable links,
  from which you will understand why SLIME is so great and amazing.
</li>
<li><a href="http://lisp-book.org/contents/chslime.pdf">Chapter 18. SLIME</a> from <a href="http://lisp-book.org/contents/chslime.pdf">Lisp Outside the Box</a> provides a really detailed guide
  to SLIME.
</li>
<li><a href="http://common-lisp.net/project/slime/doc/html/">SLIME User Manual</a> provides expert information and is your lifelong friend.
</li>
<li>For Chinese, <a href="http://www.feime.net/2013/%E6%96%B0%E5%B9%B4%E7%AC%AC%E4%B8%80%E7%AF%87-%E7%BB%99lisp%E6%96%B0%E6%89%8B%E4%BB%8B%E7%BB%8D%E4%B8%8Bslime%E8%BF%99%E4%B8%AA%E7%A5%9E%E5%99%A8/">Albertlee's Blog</a> provides a detailed overview of SLIME.
</li>
<li><a href="http://ghostopera.org/blog/2012/06/24/the-newbie-guide-to-common-lisp/">The Newbie Guide to Getting Started on Common Lisp</a> provides a concise and
  helpful guide to start programming with Common Lisp.
</li>
</ul>


<p>
To use SLIME, you must install an <a href="http://www.cliki.net/common%20lisp%20implementation">Lisp Implementation</a>, just like if you want to do
C programming, you must install a C compiler such as GCC. Here I recommend <a href="http://www.sbcl.org/">SBCL</a>
for you. You can get it by <code>sudo apt-get install sbcl</code> in Ubuntu/Mint/Debian.
</p>
<p>
<a href="http://www.lispworks.com/">LispWorks</a> provides a comprehensive documentation for Common Lisp called
<a href="http://www.lispworks.com/documentation/HyperSpec/Front/">hyperspec</a>, which integrates quite well with SLIME through
<code>slime-documentation-lookup</code>. You can get by <code>sudo apt-get install hyperspec</code>
in Ubuntu/Mint/Debian. To use hyperspec in ubuntu/mint, you can: <code>sudo apt-get install hyperspec</code>, which also set proper <code>common-lisp-hyperspec-root</code> for
you. On other Linux distributions, maybe you need to set it manually to tell
SLIME where to find the hyperspec document.
</p>
<p>
You can also get <a href="http://en.wikipedia.org/wiki/Common_Lisp_the_Language">CLTL</a> by <code>sudo apt-get install cltl</code>, which is the defacto
standard for Common Lisp before the ANSI standard.
</p>
<p>
Oh-my-emacs also configure <a href="http://emacs-w3m.namazu.org/">emacs-w3m</a> as the default documentation browser for
SLIME.
</p>
<p>
Oh-my-emacs integrates <a href="https://github.com/purcell/ac-slime">ac-slime</a> for instant in-buffer completion, and should be
self-adapted to your system, by which I mean, it will use an available lisp
implementation by finding it using <code>executable-find</code> instead of specifying a
fixed file path like <code>/usr/bin/sbcl</code>.
</p>
<p>
Enough stuff, enjoy your Common Lisp journey with Emacs and SLIME.
</p>



<pre class="example">(defun ome-slime-setup ()
  ;; Define multiple lisp backends
  ;; see http://nklein.com/2010/05/getting-started-with-clojureemacsslime/
  (defmacro defslime-start (name lisp-impl)
    `(when (executable-find (symbol-name ,lisp-impl))
       (defun ,name ()
         (interactive)
         (let ((slime-default-lisp ,lisp-impl))
           (slime)))))

  (setq slime-lisp-implementations
        `((sbcl (,(executable-find "sbcl")) :coding-system utf-8-unix)
          (ccl (,(executable-find "ccl")))
          (ccl64 (,(executable-find "ccl64")))
          (clisp (,(executable-find "clisp")))))

  (defslime-start slime-sbcl 'sbcl)
  (defslime-start slime-ccl 'ccl)
  (defslime-start slime-ccl64 'ccl64)
  (defslime-start slime-clisp 'clisp)

  ;; If you use ubuntu/mint, then "sudo apt-get install hyperspec" will set
  ;; this for you in a file like "/etc/emacs/site-start.d/60hyperspec.el"
  ;; (setq common-lisp-hyperspec-root "/usr/share/doc/hyperspec/")

  ;; Open SBCL rc file in lisp-mode
  (add-to-list 'auto-mode-alist '("\\.sbclrc$" . lisp-mode))

  (global-set-key (kbd "C-c s") 'slime-selector)
  (setq slime-net-coding-system 'utf-8-unix)
  (setq slime-complete-symbol*-fancy t)
  (setq slime-complete-symbol-function 'slime-fuzzy-complete-symbol)
  (setq inferior-lisp-program
        (or (executable-find "sbcl")
            (executable-find "ccl")
            (executable-find "ccl64")
            (executable-find "clisp")))
  (slime-setup '(slime-fancy
                 slime-indentation
                 slime-banner
                 slime-highlight-edits)))

(ome-install 'slime)

(defun ome-ac-slime-setup ()
  (add-hook 'slime-mode-hook
            (lambda ()
              (set-up-slime-ac t)))     ; use slime-fuzzy-complete-symbol
  (add-hook 'slime-repl-mode-hook
            (lambda ()
              (set-up-slime-ac t)))
  (eval-after-load "auto-complete"
    '(add-to-list 'ac-modes 'slime-repl-mode)))

(ome-install 'ac-slime)
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Todos</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Integrate <a href="http://www.foldr.org/~michaelw/emacs/redshank/">redshank</a>?
</li>
<li>Find a method to rebase the source tree of various CL implementations, which
  is useful for <code>slime-edit-definition</code>.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> <a href="https://github.com/swank-js/swank-js">swank-js</a>, <a href="http://common-lisp.net/~crhodes/swankr/">swankr</a>
</p>


</div>
</div>

</div>
</div>
</div>

</body>
</html>
